src/cfe/Catalogs/http_APIКлючи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>http_APIКлючи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешКлюча</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/http_АутентификацияСлужебный/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// http_АутентификацияСлужебный
//
// Реализация типовых способов аутентификации HTTP-запросов:
//   Basic  - через ПользователиИнформационнойБазы платформы.
//            Платформа сама выполняет Basic-auth для HTTPService (если
//            ИспользоватьСеансы=ИспользоватьАвтоматически и сервис не помечен
//            как анонимный). Наш код проверяет результат и обогащает контекст.
//   APIKey - через справочник http_APIКлючи: сверка SHA-256 хеша.
//   Bearer - переопределяемый: проверку токена делает прикладной код
//            (см. http_АутентификацияПереопределяемый.ПроверитьBearerТокен).
//
// Все функции возвращают Истина при успехе, Ложь при отказе.
// При отказе вызывают http_HTTPКонвейер.УстановитьОшибку().
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Basic-аутентификация.
// Платформа выполняет проверку логина/пароля при поступлении запроса в
// HTTPService с ИспользоватьСеансы=ИспользоватьАвтоматически. Если
// заголовок Authorization Basic некорректен или пользователь не найден -
// HTTP-сервис вернёт 401 без захода в наш код.
//
// Здесь мы:
//   1. Подтверждаем что в заголовке действительно Basic (для понятных ошибок).
//   2. Получаем текущего пользователя ИБ - это и есть аутентифицированный.
//   3. Заполняем Контекст.Аутентификация ссылкой на Catalog.Пользователи
//      (через стандартный механизм БСП "Пользователи").
//
// Параметры:
//  Контекст  - Структура - контекст конвейера.
//  Параметры - Структура - параметры аутентификации из маршрута (не используются).
//
// Возвращаемое значение:
//  Булево
//
Функция АутентификацияBasic(Контекст, Параметры) Экспорт

	Заголовок = http_АдаптерЗапросОтветСлужебный.ЗапросЗаголовок(Контекст.HTTPЗапрос, "Authorization");
	Если ПустаяСтрока(Заголовок) Или Лев(Заголовок, 6) <> "Basic " Тогда
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 401, "Требуется аутентификация Basic");
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Контекст.HTTPОтвет,
			"WWW-Authenticate", "Basic realm=""API""");
		Возврат Ложь;
	КонецЕсли;

	ТекущийПользовательИБ = ПолучитьТекущегоПользователяИБ();
	Если ТекущийПользовательИБ = Неопределено Или ПустаяСтрока(ТекущийПользовательИБ.Имя) Тогда
		// Пользователь не аутентифицирован - платформа не пропустила Basic.
		// Сюда мы попадаем только если сервис помечен как анонимный,
		// но прикладной маршрут требует Basic.
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 401, "Неверные учётные данные");
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Контекст.HTTPОтвет,
			"WWW-Authenticate", "Basic realm=""API""");
		Возврат Ложь;
	КонецЕсли;

	ЗаполнитьАутентификациюПоПользователюИБ(Контекст, ТекущийПользовательИБ);
	Возврат Истина;

КонецФункции

// APIKey-аутентификация.
// Ищет ключ в заголовке (по умолчанию X-API-Key) и сверяет SHA-256 хеш
// со справочником http_APIКлючи. Не использует сеанс пользователя -
// прикладной обработчик при необходимости устанавливает привилегированный
// режим или сам ограничивает доступ по Контекст.Аутентификация.Пользователь.
//
// Параметры:
//  Контекст  - Структура - контекст конвейера.
//  Параметры - Структура - { ИмяЗаголовка } - имя HTTP-заголовка с ключом.
//
// Возвращаемое значение:
//  Булево
//
Функция АутентификацияAPIKey(Контекст, Параметры) Экспорт

	ИмяЗаголовка = "X-API-Key";
	Если ТипЗнч(Параметры) = Тип("Структура")
		И Параметры.Свойство("ИмяЗаголовка")
		И Не ПустаяСтрока(Параметры.ИмяЗаголовка) Тогда
		ИмяЗаголовка = Параметры.ИмяЗаголовка;
	КонецЕсли;

	Ключ = http_АдаптерЗапросОтветСлужебный.ЗапросЗаголовок(Контекст.HTTPЗапрос, ИмяЗаголовка);
	Если ПустаяСтрока(Ключ) Тогда
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 401, "Требуется API ключ",
			"Отсутствует заголовок " + ИмяЗаголовка);
		Возврат Ложь;
	КонецЕсли;

	ДанныеКлюча = НайтиКлючПоПлейнтекст(Ключ);
	Если ДанныеКлюча = Неопределено Тогда
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 401, "Неверный API ключ");
		Возврат Ложь;
	КонецЕсли;

	ЗаполнитьАутентификациюПоAPIКлючу(Контекст, ДанныеКлюча);

	// Обновляем дату последнего использования (асинхронно через фоновое задание - не блокируем)
	ОтметитьИспользованиеКлючаАсинхронно(ДанныеКлюча.Ссылка);

	Возврат Истина;

КонецФункции

// Bearer-аутентификация. Делегирует проверку токена прикладному модулю
// http_АутентификацияПереопределяемый. Если прикладной код не обработал
// токен - считаем фолбэк-режим: непустой токен принимается без проверки
// (для интеграционных пресетов, где валидация уже сделана прокси).
//
// Параметры:
//  Контекст  - Структура - контекст конвейера.
//  Параметры - Структура - параметры маршрута (не используются).
//
// Возвращаемое значение:
//  Булево
//
Функция АутентификацияBearer(Контекст, Параметры) Экспорт

	Заголовок = http_АдаптерЗапросОтветСлужебный.ЗапросЗаголовок(Контекст.HTTPЗапрос, "Authorization");
	Если ПустаяСтрока(Заголовок) Тогда
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 401, "Требуется токен",
			"Отсутствует заголовок Authorization");
		Возврат Ложь;
	КонецЕсли;

	Если Лев(Заголовок, 7) <> "Bearer " Тогда
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 401, "Неверный формат токена",
			"Ожидается 'Bearer <token>'");
		Возврат Ложь;
	КонецЕсли;

	Токен = Сред(Заголовок, 8);
	Если ПустаяСтрока(Токен) Тогда
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 401, "Пустой токен");
		Возврат Ложь;
	КонецЕсли;

	Аутентификация = НовыйОписаниеАутентификации();
	Обработано     = Ложь;

	Попытка
		http_АутентификацияПереопределяемый.ПроверитьBearerТокен(Контекст, Токен, Аутентификация, Обработано);
	Исключение
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 500, "Ошибка проверки Bearer-токена",
			ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Если Обработано Тогда
		// Прикладной код мог уже установить ошибку. Если ошибки нет - принимаем
		// результат и копируем Аутентификация в контекст.
		Если http_HTTPКонвейер.ЕстьОшибка(Контекст) Тогда
			Возврат Ложь;
		КонецЕсли;
		ЗаполнитьАутентификациюПоВнешнемуТокену(Контекст, Аутентификация);
		Возврат Истина;
	КонецЕсли;

	// Прикладной код не обработал - фолбэк: токен принимается как есть
	// (полезно для интеграций где валидация сделана выше по стеку).
	Контекст.Аутентификация.Успешно = Истина;
	Контекст.Аутентификация.Вставить("ИдентификаторПользователя", "");
	Контекст.Аутентификация.Вставить("Роли", Новый Массив);
	ЗаписьЖурналаРегистрации(
		"http_АутентификацияСлужебный: Bearer-токен принят без проверки (нет переопределения ПроверитьBearerТокен)",
		УровеньЖурналаРегистрации.Предупреждение);
	Возврат Истина;

КонецФункции

// Конструктор API-ключа: генерирует случайный plaintext-ключ, сохраняет
// его SHA-256 хеш в справочнике, возвращает структуру с plain-значением.
// Plain-значение можно показать пользователю ОДИН раз - после возврата
// в системе остаётся только хеш.
//
// Параметры:
//  Наименование - Строка - название ключа (видимое в справочнике).
//  Пользователь - CatalogRef.Пользователи - владелец ключа.
//  Описание     - Строка - произвольное описание.
//
// Возвращаемое значение:
//  Структура:
//   * Ссылка    - CatalogRef.http_APIКлючи - созданный элемент справочника.
//   * Plaintext - Строка - сам ключ (показать пользователю один раз).
//
Функция СоздатьAPIКлюч(Наименование, Пользователь, Описание = "") Экспорт

	Plaintext = СгенерироватьСлучайныйКлюч();
	Хеш       = ХешSHA256Hex(Plaintext);

	ОбъектКлюча = Справочники.http_APIКлючи.СоздатьЭлемент();
	ОбъектКлюча.Наименование               = Наименование;
	ОбъектКлюча.Пользователь               = Пользователь;
	ОбъектКлюча.Описание                   = Описание;
	ОбъектКлюча.Активен                    = Истина;
	ОбъектКлюча.ДатаСоздания               = ТекущаяДатаСеанса();
	ОбъектКлюча.ХешКлюча                   = Хеш;
	ОбъектКлюча.Записать();

	Результат = Новый Структура;
	Результат.Вставить("Ссылка",    ОбъектКлюча.Ссылка);
	Результат.Вставить("Plaintext", Plaintext);
	Возврат Результат;

КонецФункции

// Обновляет ДатуПоследнегоИспользования у API-ключа. Точка входа для
// фонового задания, запускаемого АутентификацияAPIKey.
//
// Параметры:
//  Ссылка - CatalogRef.http_APIКлючи
//
Процедура ОтметитьИспользованиеКлюча(Ссылка) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ОбъектКлюча = Ссылка.ПолучитьОбъект();
		Если ОбъектКлюча = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОбъектКлюча.ДатаПоследнегоИспользования = ТекущаяДатаСеанса();
		ОбъектКлюча.ОбменДанными.Загрузка = Истина; // не вызываем подписки на события
		ОбъектКлюча.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			"http_АутентификацияСлужебный: ошибка обновления даты использования ключа",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Структура для передачи в http_АутентификацияПереопределяемый.
Функция НовыйОписаниеАутентификации()

	А = Новый Структура;
	А.Вставить("ИдентификаторПользователя", "");
	А.Вставить("Пользователь",              Неопределено);
	А.Вставить("Роли",                      Новый Массив);
	А.Вставить("Свойства",                  Новый Структура);
	Возврат А;

КонецФункции

// Возвращает текущего ПользователяИБ или Неопределено, если сеанс анонимный.
Функция ПолучитьТекущегоПользователяИБ()

	Попытка
		Возврат ПользователиИнформационнойБазы.ТекущийПользователь();
	Исключение
		ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Заполняет Контекст.Аутентификация по данным аутентифицированного пользователя ИБ.
Процедура ЗаполнитьАутентификациюПоПользователюИБ(Контекст, ПользовательИБ)

	Контекст.Аутентификация.Успешно = Истина;
	Контекст.Аутентификация.Вставить("ИдентификаторПользователя", Строка(ПользовательИБ.УникальныйИдентификатор));
	Контекст.Аутентификация.Вставить("ИмяПользователяИБ",         ПользовательИБ.Имя);

	// Связанный элемент Справочник.Пользователи (БСП-стиль) - ищем по UUID
	Пользователь = НайтиПользователяПоUUID(ПользовательИБ.УникальныйИдентификатор);
	Контекст.Аутентификация.Вставить("Пользователь", Пользователь);
	Контекст.Аутентификация.Вставить("Роли",         Новый Массив);
	Контекст.Аутентификация.Вставить("Свойства",     Новый Структура);

КонецПроцедуры

// Заполняет Контекст.Аутентификация по данным найденного API-ключа.
Процедура ЗаполнитьАутентификациюПоAPIКлючу(Контекст, ДанныеКлюча)

	Контекст.Аутентификация.Успешно = Истина;
	Контекст.Аутентификация.Вставить("Пользователь",              ДанныеКлюча.Пользователь);
	Контекст.Аутентификация.Вставить("ИдентификаторПользователя",
		?(ЗначениеЗаполнено(ДанныеКлюча.Пользователь),
			Строка(ДанныеКлюча.Пользователь.УникальныйИдентификатор()), ""));
	Контекст.Аутентификация.Вставить("Роли",         Новый Массив);
	Контекст.Аутентификация.Вставить("Свойства",     Новый Структура);
	Контекст.Аутентификация.Свойства.Вставить("APIКлюч", ДанныеКлюча.Ссылка);

КонецПроцедуры

// Копирует Аутентификацию, заполненную прикладным кодом, в Контекст.
Процедура ЗаполнитьАутентификациюПоВнешнемуТокену(Контекст, Аутентификация)

	Контекст.Аутентификация.Успешно = Истина;
	Контекст.Аутентификация.Вставить("ИдентификаторПользователя", Аутентификация.ИдентификаторПользователя);
	Контекст.Аутентификация.Вставить("Пользователь",              Аутентификация.Пользователь);
	Контекст.Аутентификация.Вставить("Роли",                      Аутентификация.Роли);
	Контекст.Аутентификация.Вставить("Свойства",                  Аутентификация.Свойства);

КонецПроцедуры

// Ищет элемент Справочник.Пользователи по UUID пользователя ИБ
// (стандартный реквизит ИдентификаторПользователяИБ в БСП).
Функция НайтиПользователяПоUUID(UUID)

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &UUID");
	Запрос.УстановитьПараметр("UUID", UUID);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Ищет API-ключ по plaintext - хеширует и сверяет с ХешКлюча в справочнике.
// Возвращает Неопределено если не найден, не активен или помечен на удаление.
Функция НайтиКлючПоПлейнтекст(Plaintext)

	Хеш = ХешSHA256Hex(Plaintext);

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	http_APIКлючи.Ссылка       КАК Ссылка,
		|	http_APIКлючи.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.http_APIКлючи КАК http_APIКлючи
		|ГДЕ
		|	http_APIКлючи.ХешКлюча = &Хеш
		|	И http_APIКлючи.Активен
		|	И НЕ http_APIКлючи.ПометкаУдаления");
	Запрос.УстановитьПараметр("Хеш", Хеш);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Ссылка",       Выборка.Ссылка);
		Результат.Вставить("Пользователь", Выборка.Пользователь);
		Возврат Результат;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// SHA-256 от строки в hex (lower-case, без пробелов).
Функция ХешSHA256Hex(Строка)

	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(Строка);
	Возврат НРег(СтрЗаменить(ХешированиеДанных.ХешСумма, " ", ""));

КонецФункции

// Случайный 32-байтовый ключ в base64url-кодировке (~43 символа).
Функция СгенерироватьСлучайныйКлюч()

	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Буфер = Новый БуферДвоичныхДанных(32);
	Для Индекс = 0 По 31 Цикл
		Буфер.Установить(Индекс, ГСЧ.СлучайноеЧисло(0, 255));
	КонецЦикла;
	Двоичные = ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(Буфер);

	Кодированный = Base64Строка(Двоичные);
	Кодированный = СтрЗаменить(Кодированный, Символы.ВК, "");
	Кодированный = СтрЗаменить(Кодированный, Символы.ПС, "");
	// base64url: + -> -, / -> _, без padding
	Кодированный = СтрЗаменить(Кодированный, "+", "-");
	Кодированный = СтрЗаменить(Кодированный, "/", "_");
	Кодированный = СтрЗаменить(Кодированный, "=", "");
	Возврат Кодированный;

КонецФункции

// Асинхронное обновление даты использования ключа через фоновое задание.
Процедура ОтметитьИспользованиеКлючаАсинхронно(Ссылка)

	Попытка
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Ссылка);
		ФоновыеЗадания.Выполнить("http_АутентификацияСлужебный.ОтметитьИспользованиеКлюча", МассивПараметров);
	Исключение
		ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
